[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:25:46
   testIdPrefix,
   currentUser,
 }) {
-  const [postModal, setPostModal] = useState(false);
+  const [postModal, setPostModal] = useState(true);
   const [csvModal, setCsvModal] = useState(false);
   const [csvErrorModal, setCsvErrorModal] = useState(false);
killedBy: EnrollmentTabComponent Tests Table Renders with no students
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-post-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:26:44
   currentUser,
 }) {
   const [postModal, setPostModal] = useState(false);
-  const [csvModal, setCsvModal] = useState(false);
+  const [csvModal, setCsvModal] = useState(true);
   const [csvErrorModal, setCsvErrorModal] = useState(false);
   const [csvErrorModalData, setCsvErrorModalData] = useState(null);
killedBy: EnrollmentTabComponent Tests Table Renders with no students
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-csv-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:27:54
 }) {
   const [postModal, setPostModal] = useState(false);
   const [csvModal, setCsvModal] = useState(false);
-  const [csvErrorModal, setCsvErrorModal] = useState(false);
+  const [csvErrorModal, setCsvErrorModal] = useState(true);
   const [csvErrorModalData, setCsvErrorModalData] = useState(null);
 
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of null (reading 'length')

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:35:5
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/rosterstudents/course/${courseId}` },
     [],
-    true,
+    false,
   );
   const [searchTerm, setSearchTerm] = useState("");
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: expected "spy" to not be called at all, but actually been called 2 times

Received: 

  1st spy call:

    Array [
      "Error communicating with backend via GET on /api/rosterstudents/course/1",

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:39:48
   );
   const [searchTerm, setSearchTerm] = useState("");
 
-  const objectToAxiosParamsCSV = (formData) => {
-    const file = new FormData();
-    file.append("file", formData.upload[0]);
-    return {
-      url: `/api/rosterstudents/upload/csv`,
-      data: file,
-      params: {
-        courseId: courseId,
-      },
-      method: "POST",
-    };
-  };
+  const objectToAxiosParamsCSV = (formData) => {};
 
   const objectToAxiosParamsPost = (student) => ({
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: Cannot read properties of undefined (reading 'params')

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:41:17
 
   const objectToAxiosParamsCSV = (formData) => {
     const file = new FormData();
-    file.append("file", formData.upload[0]);
+    file.append("", formData.upload[0]);
     return {
       url: `/api/rosterstudents/upload/csv`,
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: expected null to deeply equal File{ …(1) }

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:43:12
     const file = new FormData();
     file.append("file", formData.upload[0]);
     return {
-      url: `/api/rosterstudents/upload/csv`,
+      url: ``,
       data: file,
       params: {
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: expected "spy" to be called with arguments: [ 'Roster successfully updated.' ]

Number of calls: 0

[Killed] ObjectLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:45:15
     return {
       url: `/api/rosterstudents/upload/csv`,
       data: file,
-      params: {
-        courseId: courseId,
-      },
+      params: {},
       method: "POST",
     };
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: expected {} to deeply equal { courseId: 7 }

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:52:35
     };
   };
 
-  const objectToAxiosParamsPost = (student) => ({
-    url: `/api/rosterstudents/post`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      firstName: student.firstName,
-      lastName: student.lastName,
-      studentId: student.studentId,
-      email: student.email,
-    },
-  });
+  const objectToAxiosParamsPost = () => undefined;
 
   const onSuccessRoster = (modalFn) => {
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:52:49
     };
   };
 
-  const objectToAxiosParamsPost = (student) => ({
-    url: `/api/rosterstudents/post`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      firstName: student.firstName,
-      lastName: student.lastName,
-      studentId: student.studentId,
-      email: student.email,
-    },
-  });
+  const objectToAxiosParamsPost = (student) => ({});
 
   const onSuccessRoster = (modalFn) => {
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:54:13
 
   const objectToAxiosParamsPost = (student) => ({
     url: `/api/rosterstudents/post`,
-    method: "POST",
+    method: "",
     params: {
       courseId: courseId,
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:64:40
     },
   });
 
-  const onSuccessRoster = (modalFn) => {
-    toast("Roster successfully updated.");
-    // Clear the search filter to show the updated roster
-    setSearchTerm("");
-    modalFn(false);
-  };
+  const onSuccessRoster = (modalFn) => {};
 
   const rosterPostMutation = useBackendMutation(
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: expected "spy" to be called with arguments: [ 'Roster successfully updated.' ]

Number of calls: 0

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:67:19
   const onSuccessRoster = (modalFn) => {
     toast("Roster successfully updated.");
     // Clear the search filter to show the updated roster
-    setSearchTerm("");
+    setSearchTerm("Stryker was here!");
     modalFn(false);
   };
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:68:13
     toast("Roster successfully updated.");
     // Clear the search filter to show the updated roster
     setSearchTerm("");
-    modalFn(false);
+    modalFn(true);
   };
 
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-csv-modal"
>
  <div
    class="modal-content"

[Killed] ObjectLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:73:5
 
   const rosterPostMutation = useBackendMutation(
     objectToAxiosParamsPost,
-    {
-      onSuccess: () => onSuccessRoster(setPostModal),
-      onError: (error) => {
-        toast.error(
-          `Error adding student: ${JSON.stringify(error.response.data, null, 2)}`,
-        );
-      },
-    },
+    {},
     [`/api/rosterstudents/course/${courseId}`],
   );
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:74:18
   const rosterPostMutation = useBackendMutation(
     objectToAxiosParamsPost,
     {
-      onSuccess: () => onSuccessRoster(setPostModal),
+      onSuccess: () => undefined,
       onError: (error) => {
         toast.error(
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:75:27
     objectToAxiosParamsPost,
     {
       onSuccess: () => onSuccessRoster(setPostModal),
-      onError: (error) => {
-        toast.error(
-          `Error adding student: ${JSON.stringify(error.response.data, null, 2)}`,
-        );
-      },
+      onError: (error) => {},
     },
     [`/api/rosterstudents/course/${courseId}`],
killedBy: EnrollmentTabComponent Tests RosterStudentForm works on error
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrayDeclaration
main/components/TabComponent/EnrollmentTabComponent.jsx:81:5
         );
       },
     },
-    [`/api/rosterstudents/course/${courseId}`],
+    [],
   );
 
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: expected +0 to deeply equal 1

[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:87:18
   const rosterCsvMutation = useBackendMutation(
     objectToAxiosParamsCSV,
     {
-      onSuccess: () => onSuccessRoster(setCsvModal),
+      onSuccess: () => undefined,
       onError: (error) => {
         if (error.response.status !== 409) {
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: expected "spy" to be called with arguments: [ 'Roster successfully updated.' ]

Number of calls: 0

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:88:27
     objectToAxiosParamsCSV,
     {
       onSuccess: () => onSuccessRoster(setCsvModal),
-      onError: (error) => {
-        if (error.response.status !== 409) {
-          toast.error(
-            `Error uploading CSV: ${JSON.stringify(error.response.data, null, 2)}`,
-          );
-        } else {
-          setCsvErrorModal(true);
-          setCsvErrorModalData(error.response.data.rejected);
-          setCsvModal(false);
-        }
-      },
+      onError: (error) => {},
     },
     [`/api/rosterstudents/course/${courseId}`],
killedBy: EnrollmentTabComponent Tests CsvForm error returns correctly
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] EqualityOperator
main/components/TabComponent/EnrollmentTabComponent.jsx:89:13
     {
       onSuccess: () => onSuccessRoster(setCsvModal),
       onError: (error) => {
-        if (error.response.status !== 409) {
+        if (error.response.status === 409) {
           toast.error(
             `Error uploading CSV: ${JSON.stringify(error.response.data, null, 2)}`,
killedBy: EnrollmentTabComponent Tests CsvForm error returns correctly
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:89:13
     {
       onSuccess: () => onSuccessRoster(setCsvModal),
       onError: (error) => {
-        if (error.response.status !== 409) {
+        if (false) {
           toast.error(
             `Error uploading CSV: ${JSON.stringify(error.response.data, null, 2)}`,
killedBy: EnrollmentTabComponent Tests CsvForm error returns correctly
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:93:16
           toast.error(
             `Error uploading CSV: ${JSON.stringify(error.response.data, null, 2)}`,
           );
-        } else {
-          setCsvErrorModal(true);
-          setCsvErrorModalData(error.response.data.rejected);
-          setCsvModal(false);
-        }
+        } else {}
       },
     },
killedBy: EnrollmentTabComponent Tests CsvForm rejected shows modal
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-error-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:94:28
             `Error uploading CSV: ${JSON.stringify(error.response.data, null, 2)}`,
           );
         } else {
-          setCsvErrorModal(true);
+          setCsvErrorModal(false);
           setCsvErrorModalData(error.response.data.rejected);
           setCsvModal(false);
killedBy: EnrollmentTabComponent Tests CsvForm rejected shows modal
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-error-modal"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:96:23
         } else {
           setCsvErrorModal(true);
           setCsvErrorModalData(error.response.data.rejected);
-          setCsvModal(false);
+          setCsvModal(true);
         }
       },
killedBy: EnrollmentTabComponent Tests CsvForm rejected shows modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-csv-modal"
>
  <div
    class="modal-content"

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:100:6
         }
       },
     },
-    [`/api/rosterstudents/course/${courseId}`],
+    [``],
   );
 
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: expected +0 to deeply equal 1

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:103:41
     [`/api/rosterstudents/course/${courseId}`],
   );
 
-  const handleCsvSubmit = (formData) => {
-    rosterCsvMutation.mutate(formData);
-  };
+  const handleCsvSubmit = (formData) => {};
 
   const handlePostSubmit = (student) => {
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: Cannot read properties of undefined (reading 'params')

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:107:41
     rosterCsvMutation.mutate(formData);
   };
 
-  const handlePostSubmit = (student) => {
-    rosterPostMutation.mutate(student);
-  };
+  const handlePostSubmit = (student) => {};
 
   const downloadCsv = () => {
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:111:29
     rosterPostMutation.mutate(student);
   };
 
-  const downloadCsv = () => {
-    window.open(`/api/csv/rosterstudents?courseId=${courseId}`, "_blank");
-  };
+  const downloadCsv = () => {};
 
   const openCsvHelp = () => {
killedBy: EnrollmentTabComponent Tests Modals close on close buttons (respectively), download works
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:112:17
   };
 
   const downloadCsv = () => {
-    window.open(`/api/csv/rosterstudents?courseId=${courseId}`, "_blank");
+    window.open(``, "_blank");
   };
 
killedBy: EnrollmentTabComponent Tests Modals close on close buttons (respectively), download works
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  [
-   "/api/csv/rosterstudents?courseId=7",

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:115:29
     window.open(`/api/csv/rosterstudents?courseId=${courseId}`, "_blank");
   };
 
-  const openCsvHelp = () => {
-    window.open("/help/csv", "_blank");
-  };
+  const openCsvHelp = () => {};
 
   return (
killedBy: EnrollmentTabComponent Tests Info icon displays tooltip and opens help page on click
statusReason: expected "spy" to be called with arguments: [ '/help/csv', '_blank' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:116:17
   };
 
   const openCsvHelp = () => {
-    window.open("/help/csv", "_blank");
+    window.open("", "_blank");
   };
 
killedBy: EnrollmentTabComponent Tests Info icon displays tooltip and opens help page on click
statusReason: expected "spy" to be called with arguments: [ '/help/csv', '_blank' ]

Received: 

  1st spy call:

  [
-   "/help/csv",

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:123:40
     <div data-testid={`${testIdPrefix}-EnrollmentTabComponent`}>
       <Modal
         show={csvErrorModal}
-        onHide={() => setCsvErrorModal(false)}
+        onHide={() => setCsvErrorModal(true)}
         centered={true}
         data-testid={`${testIdPrefix}-csv-error-modal`}
killedBy: EnrollmentTabComponent Tests CsvForm rejected shows modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-lg modal-dialog-centered"
  data-testid="InstructorCourseShowPage-csv-error-modal"
>
  <div
    class="modal-content"

[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:123:17
     <div data-testid={`${testIdPrefix}-EnrollmentTabComponent`}>
       <Modal
         show={csvErrorModal}
-        onHide={() => setCsvErrorModal(false)}
+        onHide={() => undefined}
         centered={true}
         data-testid={`${testIdPrefix}-csv-error-modal`}
killedBy: EnrollmentTabComponent Tests CsvForm rejected shows modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-lg modal-dialog-centered"
  data-testid="InstructorCourseShowPage-csv-error-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:124:19
       <Modal
         show={csvErrorModal}
         onHide={() => setCsvErrorModal(false)}
-        centered={true}
+        centered={false}
         data-testid={`${testIdPrefix}-csv-error-modal`}
         size="lg"
killedBy: EnrollmentTabComponent Tests CsvForm rejected shows modal
statusReason: expect(element).toHaveClass("modal-dialog modal-dialog-centered")

Expected the element to have class:
  modal-dialog modal-dialog-centered
Received:
  modal-dialog modal-lg

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:136:27
           </p>
           <RosterStudentTable
             students={csvErrorModalData}
-            testIdPrefix={`${testIdPrefix}-RosterStudentTable-csv-error`}
+            testIdPrefix={``}
           />
         </ModalBody>
killedBy: EnrollmentTabComponent Tests CsvForm rejected shows modal
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-csv-error"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:142:17
       </Modal>
       <Modal
         show={csvModal}
-        onHide={() => setCsvModal(false)}
+        onHide={() => undefined}
         centered={true}
         data-testid={`${testIdPrefix}-csv-modal`}
killedBy: EnrollmentTabComponent Tests Modals close on close buttons (respectively), download works
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-csv-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:142:35
       </Modal>
       <Modal
         show={csvModal}
-        onHide={() => setCsvModal(false)}
+        onHide={() => setCsvModal(true)}
         centered={true}
         data-testid={`${testIdPrefix}-csv-modal`}
killedBy: EnrollmentTabComponent Tests Modals close on close buttons (respectively), download works
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-csv-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:143:19
       <Modal
         show={csvModal}
         onHide={() => setCsvModal(false)}
-        centered={true}
+        centered={false}
         data-testid={`${testIdPrefix}-csv-modal`}
       >
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: expect(element).toHaveClass("modal-dialog modal-dialog-centered")

Expected the element to have class:
  modal-dialog modal-dialog-centered
Received:
  modal-dialog

[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:153:17
       </Modal>
       <Modal
         show={postModal}
-        onHide={() => setPostModal(false)}
+        onHide={() => undefined}
         centered={true}
         data-testid={`${testIdPrefix}-post-modal`}
killedBy: EnrollmentTabComponent Tests Modals close on close buttons (respectively), download works
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-post-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:153:36
       </Modal>
       <Modal
         show={postModal}
-        onHide={() => setPostModal(false)}
+        onHide={() => setPostModal(true)}
         centered={true}
         data-testid={`${testIdPrefix}-post-modal`}
killedBy: EnrollmentTabComponent Tests Modals close on close buttons (respectively), download works
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-post-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:154:19
       <Modal
         show={postModal}
         onHide={() => setPostModal(false)}
-        centered={true}
+        centered={false}
         data-testid={`${testIdPrefix}-post-modal`}
       >
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: expect(element).toHaveClass("modal-dialog modal-dialog-centered")

Expected the element to have class:
  modal-dialog modal-dialog-centered
Received:
  modal-dialog

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:161:29
         <ModalBody>
           <RosterStudentForm
             submitAction={handlePostSubmit}
-            cancelDisabled={true}
+            cancelDisabled={false}
           />
         </ModalBody>
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-Secondary"
  data-testid="RosterStudentForm-cancel"
  type="button"
>
  Cancel

[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:169:24
         <Col>
           <div className="d-flex align-items-center gap-2">
             <Button
-              onClick={() => setCsvModal(true)}
+              onClick={() => undefined}
               data-testid={`${testIdPrefix}-csv-button`}
               className="w-100"
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:169:42
         <Col>
           <div className="d-flex align-items-center gap-2">
             <Button
-              onClick={() => setCsvModal(true)}
+              onClick={() => setCsvModal(false)}
               data-testid={`${testIdPrefix}-csv-button`}
               className="w-100"
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] ObjectLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:183:24
             >
               <span
                 onClick={openCsvHelp}
-                style={{
-                  cursor: "pointer",
-                  fontSize: "0.85rem",
-                  userSelect: "none",
-                }}
+                style={{}}
                 data-testid={`${testIdPrefix}-csv-info-icon`}
               >
killedBy: EnrollmentTabComponent Tests Info icon displays tooltip and opens help page on click
statusReason: expect(element).toHaveStyle()

- Expected

- cursor: pointer;

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:186:31
                 style={{
                   cursor: "pointer",
                   fontSize: "0.85rem",
-                  userSelect: "none",
+                  userSelect: "",
                 }}
                 data-testid={`${testIdPrefix}-csv-info-icon`}
killedBy: EnrollmentTabComponent Tests Info icon displays tooltip and opens help page on click
statusReason: expect(element).toHaveStyle()

- Expected

- userSelect: none;

[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:197:22
         </Col>
         <Col>
           <Button
-            onClick={() => setPostModal(true)}
+            onClick={() => undefined}
             data-testid={`${testIdPrefix}-post-button`}
             className="w-100"
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: Unable to find a label with the text of: Student Id

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:197:41
         </Col>
         <Col>
           <Button
-            onClick={() => setPostModal(true)}
+            onClick={() => setPostModal(false)}
             data-testid={`${testIdPrefix}-post-button`}
             className="w-100"
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: Unable to find a label with the text of: Student Id

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >
