[Killed] BlockStatement
main/components/Auth/SignInOptions.jsx:12:31
 const SignInOptions = ({ onSignIn }) => {
   const { data: systemInfo } = useSystemInfo();
 
-  const microsoftIcon = () => {
-    return (
-      <span data-testid={"SignInOptions-microsoftIcon"}>
-        <FaMicrosoft size={"10em"} role={"img"} />
-      </span>
-    );
-  };
+  const microsoftIcon = () => {};
 
   const googleIcon = () => {
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Unable to find an element by: [data-testid="SignInOptions-microsoftIcon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/Auth/SignInOptions.jsx:20:28
     );
   };
 
-  const googleIcon = () => {
-    return (
-      <span data-testid={"SignInOptions-googleIcon"}>
-        <FcGoogle size={"10em"} role={"img"} />
-      </span>
-    );
-  };
+  const googleIcon = () => {};
 
   return (
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element by: [data-testid="SignInOptions-googleIcon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Auth/SignInOptions.jsx:22:26
 
   const googleIcon = () => {
     return (
-      <span data-testid={"SignInOptions-googleIcon"}>
+      <span data-testid={""}>
         <FcGoogle size={"10em"} role={"img"} />
       </span>
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element by: [data-testid="SignInOptions-googleIcon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Auth/SignInOptions.jsx:33:20
       xs={1}
       md={2}
       className={"g-5 d-flex gap-5 justify-content-center align-items-center"}
-      data-testid={"SignInOptions-cardDisplay"}
+      data-testid={""}
     >
       {systemInfo.oauthLogin && (
killedBy: SignInPage Tests Base environment test
statusReason: Unable to find an element by: [data-testid="SignInOptions-cardDisplay"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/components/Auth/SignInOptions.jsx:35:8
       className={"g-5 d-flex gap-5 justify-content-center align-items-center"}
       data-testid={"SignInOptions-cardDisplay"}
     >
-      {systemInfo.oauthLogin && (
-        <SignInCard
-          Icon={googleIcon}
-          title={"Sign in with Google"}
-          description={
-            <>
-              If you have credentials with these schools, sign in with Google
-              <ul>
-                {loginProviderSchools.google.map((school, index) => (
-                  <li key={index}>{school}</li>
-                ))}
-              </ul>
-            </>
-          }
-          url={systemInfo.oauthLogin}
-          testid={"google"}
-          onClick={onSignIn}
-        />
-      )}
+      {systemInfo.oauthLogin || <SignInCard Icon={googleIcon} title={"Sign in with Google"} description={<>
+              If you have credentials with these schools, sign in with Google
+              <ul>
+                {loginProviderSchools.google.map((school, index) => <li key={index}>{school}</li>)}
+              </ul>
+            </>} url={systemInfo.oauthLogin} testid={"google"} onClick={onSignIn} />}
       {systemInfo.activeDirectoryUrl && (
         <SignInCard
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] ConditionalExpression
main/components/Auth/SignInOptions.jsx:35:8
       className={"g-5 d-flex gap-5 justify-content-center align-items-center"}
       data-testid={"SignInOptions-cardDisplay"}
     >
-      {systemInfo.oauthLogin && (
-        <SignInCard
-          Icon={googleIcon}
-          title={"Sign in with Google"}
-          description={
-            <>
-              If you have credentials with these schools, sign in with Google
-              <ul>
-                {loginProviderSchools.google.map((school, index) => (
-                  <li key={index}>{school}</li>
-                ))}
-              </ul>
-            </>
-          }
-          url={systemInfo.oauthLogin}
-          testid={"google"}
-          onClick={onSignIn}
-        />
-      )}
+      {false}
       {systemInfo.activeDirectoryUrl && (
         <SignInCard
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element with the text: Sign in with Google. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/components/Auth/SignInOptions.jsx:54:8
           onClick={onSignIn}
         />
       )}
-      {systemInfo.activeDirectoryUrl && (
-        <SignInCard
-          Icon={microsoftIcon}
-          title={"Sign in with Microsoft"}
-          description={
-            <>
-              If you have credentials with these schools, sign in with Microsoft
-              <ul>
-                {loginProviderSchools.microsoft.map((school, index) => (
-                  <li key={index}>{school}</li>
-                ))}
-              </ul>
-            </>
-          }
-          url={systemInfo.activeDirectoryUrl}
-          testid={"microsoft"}
-          onClick={onSignIn}
-        />
-      )}
+      {systemInfo.activeDirectoryUrl || <SignInCard Icon={microsoftIcon} title={"Sign in with Microsoft"} description={<>
+              If you have credentials with these schools, sign in with Microsoft
+              <ul>
+                {loginProviderSchools.microsoft.map((school, index) => <li key={index}>{school}</li>)}
+              </ul>
+            </>} url={systemInfo.activeDirectoryUrl} testid={"microsoft"} onClick={onSignIn} />}
     </Row>
   );
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Found multiple elements with the role "img"

Here are the matching elements:

Ignored nodes: comments, script, style
<svg
  enable-background="new 0 0 48 48"
  fill="currentColor"

[Killed] ConditionalExpression
main/components/Auth/SignInOptions.jsx:54:8
           onClick={onSignIn}
         />
       )}
-      {systemInfo.activeDirectoryUrl && (
-        <SignInCard
-          Icon={microsoftIcon}
-          title={"Sign in with Microsoft"}
-          description={
-            <>
-              If you have credentials with these schools, sign in with Microsoft
-              <ul>
-                {loginProviderSchools.microsoft.map((school, index) => (
-                  <li key={index}>{school}</li>
-                ))}
-              </ul>
-            </>
-          }
-          url={systemInfo.activeDirectoryUrl}
-          testid={"microsoft"}
-          onClick={onSignIn}
-        />
-      )}
+      {false}
     </Row>
   );
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Unable to find an element with the text: Sign in with Microsoft. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
