[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:198:26
         <Col>
           <Button
             onClick={() => setPostModal(true)}
-            data-testid={`${testIdPrefix}-post-button`}
+            data-testid={``}
             className="w-100"
           >
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-post-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:221:27
                 type="text"
                 placeholder="Search by name, email, student ID, or Github Login"
                 value={searchTerm}
-                onChange={(e) => setSearchTerm(e.target.value)}
+                onChange={() => undefined}
                 data-testid={`${testIdPrefix}-search`}
               />
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: expected '' to be 'test search' // Object.is equality

[Killed] MethodExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:230:21
       </Row>
       <Row>
         <RosterStudentTable
-          students={rosterStudents
-            .filter((student) => {
-              const searchTermLower = searchTerm.toLowerCase();
-              const fullName = `${student.firstName} ${student.lastName}`;
-              if (student.studentId.toLowerCase().includes(searchTermLower)) {
-                return true;
-              } else if (
-                student.email.toLowerCase().includes(searchTermLower)
-              ) {
-                return true;
-              } else if (
-                student.githubLogin?.toLowerCase().includes(searchTermLower)
-              ) {
-                return true;
-              } else if (fullName.toLowerCase().includes(searchTermLower)) {
-                return true;
-              }
-              return false;
-            })
-            .filter((student) => student.rosterStatus !== "DROPPED")}
+          students={rosterStudents.filter(student => {
+  const searchTermLower = searchTerm.toLowerCase();
+  const fullName = `${student.firstName} ${student.lastName}`;
+  if (student.studentId.toLowerCase().includes(searchTermLower)) {
+    return true;
+  } else if (student.email.toLowerCase().includes(searchTermLower)) {
+    return true;
+  } else if (student.githubLogin?.toLowerCase().includes(searchTermLower)) {
+    return true;
+  } else if (fullName.toLowerCase().includes(searchTermLower)) {
+    return true;
+  }
+  return false;
+})}
           currentUser={currentUser}
           courseId={courseId}
killedBy: EnrollmentTabComponent Tests Dropped Students appear correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-3-col-email"
>
  aryasue@ucsb.edu
</td> instead

[Killed] MethodExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:230:21
       </Row>
       <Row>
         <RosterStudentTable
-          students={rosterStudents
-            .filter((student) => {
-              const searchTermLower = searchTerm.toLowerCase();
-              const fullName = `${student.firstName} ${student.lastName}`;
-              if (student.studentId.toLowerCase().includes(searchTermLower)) {
-                return true;
-              } else if (
-                student.email.toLowerCase().includes(searchTermLower)
-              ) {
-                return true;
-              } else if (
-                student.githubLogin?.toLowerCase().includes(searchTermLower)
-              ) {
-                return true;
-              } else if (fullName.toLowerCase().includes(searchTermLower)) {
-                return true;
-              }
-              return false;
-            })
+          students={rosterStudents
             .filter((student) => student.rosterStatus !== "DROPPED")}
           currentUser={currentUser}
killedBy: EnrollmentTabComponent Tests Search filter works correctly First Name, Email
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Emma
Received:
  Alice

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:231:34
       <Row>
         <RosterStudentTable
           students={rosterStudents
-            .filter((student) => {
-              const searchTermLower = searchTerm.toLowerCase();
-              const fullName = `${student.firstName} ${student.lastName}`;
-              if (student.studentId.toLowerCase().includes(searchTermLower)) {
-                return true;
-              } else if (
-                student.email.toLowerCase().includes(searchTermLower)
-              ) {
-                return true;
-              } else if (
-                student.githubLogin?.toLowerCase().includes(searchTermLower)
-              ) {
-                return true;
-              } else if (fullName.toLowerCase().includes(searchTermLower)) {
-                return true;
-              }
-              return false;
-            })
+            .filter((student) => {})
             .filter((student) => student.rosterStatus !== "DROPPED")}
           currentUser={currentUser}
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] MethodExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:232:39
         <RosterStudentTable
           students={rosterStudents
             .filter((student) => {
-              const searchTermLower = searchTerm.toLowerCase();
+              const searchTermLower = searchTerm.toUpperCase();
               const fullName = `${student.firstName} ${student.lastName}`;
               if (student.studentId.toLowerCase().includes(searchTermLower)) {
killedBy: EnrollmentTabComponent Tests Search filter works correctly First Name, Email
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-firstName"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:233:32
           students={rosterStudents
             .filter((student) => {
               const searchTermLower = searchTerm.toLowerCase();
-              const fullName = `${student.firstName} ${student.lastName}`;
+              const fullName = ``;
               if (student.studentId.toLowerCase().includes(searchTermLower)) {
                 return true;
killedBy: EnrollmentTabComponent Tests Search filter works correctly First Name, Email
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-firstName"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] MethodExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:234:19
             .filter((student) => {
               const searchTermLower = searchTerm.toLowerCase();
               const fullName = `${student.firstName} ${student.lastName}`;
-              if (student.studentId.toLowerCase().includes(searchTermLower)) {
+              if (student.studentId.toUpperCase().includes(searchTermLower)) {
                 return true;
               } else if (
killedBy: EnrollmentTabComponent Tests Search filter works correctly GitHub Login, Student ID
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-studentId"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:234:19
             .filter((student) => {
               const searchTermLower = searchTerm.toLowerCase();
               const fullName = `${student.firstName} ${student.lastName}`;
-              if (student.studentId.toLowerCase().includes(searchTermLower)) {
+              if (false) {
                 return true;
               } else if (
killedBy: EnrollmentTabComponent Tests Search filter works correctly GitHub Login, Student ID
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-studentId"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:235:24
               const searchTermLower = searchTerm.toLowerCase();
               const fullName = `${student.firstName} ${student.lastName}`;
               if (student.studentId.toLowerCase().includes(searchTermLower)) {
-                return true;
+                return false;
               } else if (
                 student.email.toLowerCase().includes(searchTermLower)
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:237:17
               if (student.studentId.toLowerCase().includes(searchTermLower)) {
                 return true;
               } else if (
-                student.email.toLowerCase().includes(searchTermLower)
+                true
               ) {
                 return true;
killedBy: EnrollmentTabComponent Tests Search filter works correctly First Name, Email
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Emma
Received:
  Alice

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:237:17
               if (student.studentId.toLowerCase().includes(searchTermLower)) {
                 return true;
               } else if (
-                student.email.toLowerCase().includes(searchTermLower)
+                false
               ) {
                 return true;
killedBy: EnrollmentTabComponent Tests Search filter works correctly First Name, Email
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:238:17
                 return true;
               } else if (
                 student.email.toLowerCase().includes(searchTermLower)
-              ) {
-                return true;
-              } else if (
+              ) {} else if (
                 student.githubLogin?.toLowerCase().includes(searchTermLower)
               ) {
killedBy: EnrollmentTabComponent Tests Search filter works correctly First Name, Email
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:239:24
               } else if (
                 student.email.toLowerCase().includes(searchTermLower)
               ) {
-                return true;
+                return false;
               } else if (
                 student.githubLogin?.toLowerCase().includes(searchTermLower)
killedBy: EnrollmentTabComponent Tests Search filter works correctly First Name, Email
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] MethodExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:241:17
               ) {
                 return true;
               } else if (
-                student.githubLogin?.toLowerCase().includes(searchTermLower)
+                student.githubLogin?.toUpperCase().includes(searchTermLower)
               ) {
                 return true;
killedBy: EnrollmentTabComponent Tests Search filter works correctly GitHub Login, Student ID
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-githubLogin"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:241:17
               ) {
                 return true;
               } else if (
-                student.githubLogin?.toLowerCase().includes(searchTermLower)
+                true
               ) {
                 return true;
killedBy: EnrollmentTabComponent Tests Search filter works correctly First Name, Email
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Emma
Received:
  Alice

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:242:17
                 return true;
               } else if (
                 student.githubLogin?.toLowerCase().includes(searchTermLower)
-              ) {
-                return true;
-              } else if (fullName.toLowerCase().includes(searchTermLower)) {
+              ) {} else if (fullName.toLowerCase().includes(searchTermLower)) {
                 return true;
               }
killedBy: EnrollmentTabComponent Tests Search filter works correctly GitHub Login, Student ID
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-githubLogin"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:244:76
                 student.githubLogin?.toLowerCase().includes(searchTermLower)
               ) {
                 return true;
-              } else if (fullName.toLowerCase().includes(searchTermLower)) {
-                return true;
-              }
+              } else if (fullName.toLowerCase().includes(searchTermLower)) {}
               return false;
             })
killedBy: EnrollmentTabComponent Tests Search filter works correctly First Name, Email
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-firstName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] MethodExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:244:26
                 student.githubLogin?.toLowerCase().includes(searchTermLower)
               ) {
                 return true;
-              } else if (fullName.toLowerCase().includes(searchTermLower)) {
+              } else if (fullName.toUpperCase().includes(searchTermLower)) {
                 return true;
               }
killedBy: EnrollmentTabComponent Tests Search filter works correctly First Name, Email
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-firstName"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:245:24
               ) {
                 return true;
               } else if (fullName.toLowerCase().includes(searchTermLower)) {
-                return true;
+                return false;
               }
               return false;
killedBy: EnrollmentTabComponent Tests Search filter works correctly First Name, Email
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-firstName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:249:34
               }
               return false;
             })
-            .filter((student) => student.rosterStatus !== "DROPPED")}
+            .filter((student) => false)}
           currentUser={currentUser}
           courseId={courseId}
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:249:21
               }
               return false;
             })
-            .filter((student) => student.rosterStatus !== "DROPPED")}
+            .filter(() => undefined)}
           currentUser={currentUser}
           courseId={courseId}
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:252:25
             .filter((student) => student.rosterStatus !== "DROPPED")}
           currentUser={currentUser}
           courseId={courseId}
-          testIdPrefix={`${testIdPrefix}-RosterStudentTable`}
+          testIdPrefix={``}
         />
       </Row>
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] MethodExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:258:21
       <Row>
         <h2>Dropped Students</h2>
         <DroppedStudentsTable
-          students={rosterStudents.filter(
-            (student) => student.rosterStatus === "DROPPED",
-          )}
+          students={rosterStudents}
           courseId={courseId}
         />
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Found multiple elements with the text: Alice

Here are the matching elements:

Ignored nodes: comments, script, style
<td
  data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-firstName"
>

[Killed] EqualityOperator
main/components/TabComponent/EnrollmentTabComponent.jsx:259:26
         <h2>Dropped Students</h2>
         <DroppedStudentsTable
           students={rosterStudents.filter(
-            (student) => student.rosterStatus === "DROPPED",
+            (student) => student.rosterStatus !== "DROPPED",
           )}
           courseId={courseId}
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Found multiple elements with the text: Alice

Here are the matching elements:

Ignored nodes: comments, script, style
<td
  data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-firstName"
>

[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:259:13
         <h2>Dropped Students</h2>
         <DroppedStudentsTable
           students={rosterStudents.filter(
-            (student) => student.rosterStatus === "DROPPED",
+            () => undefined,
           )}
           courseId={courseId}
killedBy: EnrollmentTabComponent Tests Dropped Students appear correctly
statusReason: Unable to find an element by: [data-testid="DroppedStudentsTable-cell-row-0-col-studentId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >
