[Killed] ArrowFunction
main/components/RosterStudent/RosterStudentDropdown.jsx:11:38
   onChange,
   isInvalid,
 }) {
-  const options = rosterStudents.map((student) => ({
-    id: student.id,
-    fullName: `${student.firstName} ${student.lastName}`,
-  }));
+  const options = rosterStudents.map(() => undefined);
 
   const selectedOption = options.filter((opt) => opt.id === value);
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
main/components/RosterStudent/RosterStudentDropdown.jsx:16:50
     fullName: `${student.firstName} ${student.lastName}`,
   }));
 
-  const selectedOption = options.filter((opt) => opt.id === value);
+  const selectedOption = options.filter((opt) => opt.id !== value);
 
   const handleSelectionChange = (selected) => {
killedBy: RosterStudentForm tests renders invalid state and calls onChange correctly
statusReason: expected 5 to be 1 // Object.is equality

[Killed] MethodExpression
main/components/RosterStudent/RosterStudentDropdown.jsx:16:26
     fullName: `${student.firstName} ${student.lastName}`,
   }));
 
-  const selectedOption = options.filter((opt) => opt.id === value);
+  const selectedOption = options;
 
   const handleSelectionChange = (selected) => {
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentDropdown.jsx:19:16
   const selectedOption = options.filter((opt) => opt.id === value);
 
   const handleSelectionChange = (selected) => {
-    const id = selected.length > 0 ? selected[0].id : "";
+    const id = true ? selected[0].id : "";
     onChange(id);
   };
killedBy: RosterStudentForm tests renders invalid state and calls onChange correctly
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentDropdown.jsx:35:25
         highlightOnlyResult
         onInputChange={(text) => onChange(text)}
         inputProps={{
-          "aria-label": "Select Student",
+          "aria-label": "",
           "data-testid": "RosterStudentDropdown",
           className: isInvalid ? "form-control is-invalid" : "form-control",
killedBy: TeamsTable tests TeamsForm submit works and clears search filter
statusReason: Found a label with the text of: Select Student, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentDropdown.jsx:36:26
         onInputChange={(text) => onChange(text)}
         inputProps={{
           "aria-label": "Select Student",
-          "data-testid": "RosterStudentDropdown",
+          "data-testid": "",
           className: isInvalid ? "form-control is-invalid" : "form-control",
         }}
killedBy: RosterStudentForm tests renders invalid state and calls onChange correctly
statusReason: Unable to find an element by: [data-testid="RosterStudentDropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <input
        aria-label="Select Student"

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentDropdown.jsx:37:34
         inputProps={{
           "aria-label": "Select Student",
           "data-testid": "RosterStudentDropdown",
-          className: isInvalid ? "form-control is-invalid" : "form-control",
+          className: isInvalid ? "" : "form-control",
         }}
       />
killedBy: RosterStudentForm tests renders invalid state and calls onChange correctly
statusReason: expected '' to be 'form-control is-invalid' // Object.is equality
