[Killed] StringLiteral
main/components/Teams/TeamMemberForm.jsx:10:17
   initialContents,
   rosterStudents,
   submitAction,
-  buttonLabel = "Add Member",
+  buttonLabel = "",
   cancelDisabled = false,
 }) {
killedBy: TeamMemberForm tests displays error message when no student is selected
statusReason: Unable to find an element with the text: /Add Member/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/Teams/TeamMemberForm.jsx:11:20
   rosterStudents,
   submitAction,
   buttonLabel = "Add Member",
-  cancelDisabled = false,
+  cancelDisabled = true,
 }) {
   // Stryker disable all
killedBy: TeamMemberForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Unable to find an element by: [data-testid="TeamMemberForm-cancel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BlockStatement
main/components/Teams/TeamMemberForm.jsx:25:30
 
   const testIdPrefix = "TeamMemberForm";
 
-  const onSubmit = (data) => {
-    submitAction(data);
-  };
+  const onSubmit = (data) => {};
 
   return (
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/Teams/TeamMemberForm.jsx:36:30
         <Controller
           name="rosterStudentId"
           control={control}
-          rules={{ required: "Select a student." }}
+          rules={{ required: "" }}
           render={({ field }) => (
             <RosterStudentDropdown
killedBy: TeamMemberForm tests displays error message when no student is selected
statusReason: Unable to find an element with the text: /Select a student./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/Teams/TeamMemberForm.jsx:37:19
           name="rosterStudentId"
           control={control}
           rules={{ required: "Select a student." }}
-          render={({ field }) => (
-            <RosterStudentDropdown
-              rosterStudents={rosterStudents}
-              {...field}
-              isInvalid={Boolean(errors.rosterStudentId)}
-            />
-          )}
+          render={() => undefined}
         />
         {errors.rosterStudentId && (
killedBy: TeamMemberForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="RosterStudentDropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Teams/TeamMemberForm.jsx:45:10
             />
           )}
         />
-        {errors.rosterStudentId && (
-          <Form.Control.Feedback type="invalid">
-            {errors.rosterStudentId.message}
-          </Form.Control.Feedback>
-        )}
+        {false}
       </Form.Group>
       <Button type="submit" data-testid={testIdPrefix + "-submit"}>
killedBy: TeamMemberForm tests displays error message when no student is selected
statusReason: Unable to find an element with the text: /Select a student./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Teams/TeamMemberForm.jsx:45:10
             />
           )}
         />
-        {errors.rosterStudentId && (
-          <Form.Control.Feedback type="invalid">
-            {errors.rosterStudentId.message}
-          </Form.Control.Feedback>
-        )}
+        {errors.rosterStudentId || <Form.Control.Feedback type="invalid">
+            {errors.rosterStudentId.message}
+          </Form.Control.Feedback>}
       </Form.Group>
       <Button type="submit" data-testid={testIdPrefix + "-submit"}>
killedBy: TeamMemberForm tests renders correctly when passing in initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] LogicalOperator
main/components/Teams/TeamMemberForm.jsx:54:8
       <Button type="submit" data-testid={testIdPrefix + "-submit"}>
         {buttonLabel}
       </Button>
-      {!cancelDisabled && (
-        <Button
-          variant="Secondary"
-          onClick={() => navigate(-1)}
-          data-testid={testIdPrefix + "-cancel"}
-        >
-          Cancel
-        </Button>
-      )}
+      {!cancelDisabled || <Button variant="Secondary" onClick={() => navigate(-1)} data-testid={testIdPrefix + "-cancel"}>
+          Cancel
+        </Button>}
     </Form>
   );
killedBy: TeamMemberForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Unable to find an element by: [data-testid="TeamMemberForm-cancel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Teams/TeamMemberForm.jsx:54:8
       <Button type="submit" data-testid={testIdPrefix + "-submit"}>
         {buttonLabel}
       </Button>
-      {!cancelDisabled && (
-        <Button
-          variant="Secondary"
-          onClick={() => navigate(-1)}
-          data-testid={testIdPrefix + "-cancel"}
-        >
-          Cancel
-        </Button>
-      )}
+      {true}
     </Form>
   );
killedBy: TeamMemberForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Unable to find an element by: [data-testid="TeamMemberForm-cancel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
