[Killed] ArrowFunction
main/components/RosterStudent/RosterStudentDropdown.jsx:6:38
 import "react-bootstrap-typeahead/css/Typeahead.css";
 
 export default function RosterStudentDropdown({ rosterStudents, value, onChange, isInvalid }) {
-  const options = rosterStudents.map((student) => ({
-    id: student.id,
-    fullName: `${student.firstName} ${student.lastName}`,
-  }));
+  const options = rosterStudents.map(() => undefined);
 
   const selectedOption = options.filter((opt) => opt.id === value);
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentDropdown.jsx:11:50
     fullName: `${student.firstName} ${student.lastName}`,
   }));
 
-  const selectedOption = options.filter((opt) => opt.id === value);
+  const selectedOption = options.filter((opt) => false);
 
   const handleSelectionChange = (selected) => {
killedBy: RosterStudentForm tests renders invalid state and calls onChange correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentDropdown.jsx:11:50
     fullName: `${student.firstName} ${student.lastName}`,
   }));
 
-  const selectedOption = options.filter((opt) => opt.id === value);
+  const selectedOption = options.filter((opt) => true);
 
   const handleSelectionChange = (selected) => {
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentDropdown.jsx:13:47
 
   const selectedOption = options.filter((opt) => opt.id === value);
 
-  const handleSelectionChange = (selected) => {
-    const id = selected.length > 0 ? selected[0].id : "";
-    onChange(id);
-  };
+  const handleSelectionChange = (selected) => {};
 
   return (
killedBy: RosterStudentForm tests renders invalid state and calls onChange correctly
statusReason: expected "spy" to be called with arguments: [ 1 ]

Received: 

  1st spy call:

  [
-   1,

[Killed] EqualityOperator
main/components/RosterStudent/RosterStudentDropdown.jsx:14:16
   const selectedOption = options.filter((opt) => opt.id === value);
 
   const handleSelectionChange = (selected) => {
-    const id = selected.length > 0 ? selected[0].id : "";
+    const id = selected.length <= 0 ? selected[0].id : "";
     onChange(id);
   };
killedBy: RosterStudentForm tests renders invalid state and calls onChange correctly
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
main/components/RosterStudent/RosterStudentDropdown.jsx:14:16
   const selectedOption = options.filter((opt) => opt.id === value);
 
   const handleSelectionChange = (selected) => {
-    const id = selected.length > 0 ? selected[0].id : "";
+    const id = selected.length >= 0 ? selected[0].id : "";
     onChange(id);
   };
killedBy: RosterStudentForm tests renders invalid state and calls onChange correctly
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ArrowFunction
main/components/RosterStudent/RosterStudentDropdown.jsx:28:24
         selected={selectedOption}
         onChange={handleSelectionChange}
         highlightOnlyResult
-        onInputChange={(text) => onChange(text)}
+        onInputChange={() => undefined}
         inputProps={{
           "aria-label": "Select Student",
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/RosterStudent/RosterStudentDropdown.jsx:29:21
         onChange={handleSelectionChange}
         highlightOnlyResult
         onInputChange={(text) => onChange(text)}
-        inputProps={{
-          "aria-label": "Select Student",
-          "data-testid": "RosterStudentDropdown",
-          className: isInvalid ? "form-control is-invalid" : "form-control",
-        }}
+        inputProps={{}}
       />
     </Form.Group>
killedBy: RosterStudentForm tests renders invalid state and calls onChange correctly
statusReason: Unable to find an element by: [data-testid="RosterStudentDropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <input
        placeholder="Select a student."
