[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:28:6
     status: _statusCourse,
     failureCount: courseBackendFailureCount,
   } = useBackend(
-    [`/api/courses/${courseId}`],
+    [``],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/courses/${courseId}` },
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: expected undefined to be null // Object.is equality

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:35:27
     true,
   );
 
-  const getCourseFailed = courseBackendFailureCount > 0;
+  const getCourseFailed = true;
 
   const navigate = useNavigate();
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Course Not Found
</div> instead

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:39:9
 
   const navigate = useNavigate();
   useEffect(() => {
-    if (getCourseFailed) {
+    if (true) {
       setShowErrorModal(true);
       const timer = setTimeout(() => {
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Course Not Found
</div> instead

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:72:10
         data-testid={`${testId}-title`}
         className="d-flex align-items-center lh-1 gap-3"
       >
-        {!course ? (
+        {course ? (
           "Course: Loading..."
         ) : !course.installationId ? (
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of null (reading 'installationId')

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:73:11
         className="d-flex align-items-center lh-1 gap-3"
       >
         {!course ? (
-          "Course: Loading..."
+          ""
         ) : !course.installationId ? (
           <span>
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Course: Loading...
Received:

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:74:13
       >
         {!course ? (
           "Course: Loading..."
-        ) : !course.installationId ? (
+        ) : course.installationId ? (
           <span>
             {course.courseName}&nbsp;&nbsp;{course.term}
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="ms-2"
  data-testid="InstructorCourseShowPage-github-org-link"
  href="https://github.com/ucsb-cs156-s25"
  rel="noopener noreferrer"
  target="_blank"

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:100:23
               }
             >
               <a
-                href={`https://github.com/organizations/${course.orgName}/settings/installations/${course.installationId}`}
+                href={``}
                 target="_blank"
                 rel="noopener noreferrer"
killedBy: InstructorCourseShowPage tests expect the correct URL to the organization for the course
statusReason: expect(element).toHaveAttribute("href", "https://github.com/organizations/ucsb-cs156-s25/settings/installations/123456") // element.getAttribute("href") === "https://github.com/organizations/ucsb-cs156-s25/settings/installations/123456"

Expected the element to have attribute:
  href="https://github.com/organizations/ucsb-cs156-s25/settings/installations/123456"
Received:
  href=""

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:103:30
                 href={`https://github.com/organizations/${course.orgName}/settings/installations/${course.installationId}`}
                 target="_blank"
                 rel="noopener noreferrer"
-                data-testid={`${testId}-github-settings-link`}
+                data-testid={``}
               >
                 <GithubSettingIcon
killedBy: InstructorCourseShowPage tests expect the correct URL to the organization for the course
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-github-settings-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:115:31
           </>
         )}
       </h1>
-      <Tabs defaultActiveKey={"default"}>
+      <Tabs defaultActiveKey={""}>
         <Tab eventKey={"students"} title={"Students"} className="pt-2">
           <EnrollmentTabComponent
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:116:24
         )}
       </h1>
       <Tabs defaultActiveKey={"default"}>
-        <Tab eventKey={"students"} title={"Students"} className="pt-2">
+        <Tab eventKey={""} title={"Students"} className="pt-2">
           <EnrollmentTabComponent
             courseId={courseId}
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("data-rr-ui-event-key", "students") // element.getAttribute("data-rr-ui-event-key") === "students"

Expected the element to have attribute:
  data-rr-ui-event-key="students"
Received:
  data-rr-ui-event-key=""

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:137:24
             currentUser={currentUser}
           />
         </Tab>
-        <Tab eventKey={"default"} title={"Assignments"} className="pt-2">
+        <Tab eventKey={""} title={"Assignments"} className="pt-2">
           <AssignmentTabComponent
             courseId={courseId}
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("data-rr-ui-event-key", "default") // element.getAttribute("data-rr-ui-event-key") === "default"

Expected the element to have attribute:
  data-rr-ui-event-key="default"
Received:
  data-rr-ui-event-key=""
