[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:138:11
         break;
       case "JOINCOURSE":
         set_message =
-          "Staff member has been prompted to join, but hasn't yet clicked the 'Join Course' button to generate an invite to the organization.";
+          "";
         break;
       case "INVITED":
killedBy: CourseStaffTable tests tooltips for JOINCOURSE status
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:150:11
         break;
       case "MEMBER":
         set_message =
-          "Staff member is a member of the GitHub organization associated with this course.";
+          "";
         break;
       default:
killedBy: CourseStaffTable tests tooltips for MEMBER status
statusReason: Unable to find an element with the text: Staff member is a member of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordere

[Killed] ObjectLiteral
main/components/CourseStaff/CourseStaffTable.jsx:245:16
       />
       <OurTable data={staff} columns={columns} testid={testIdPrefix} />
       <div
-        style={{ display: "none" }}
+        style={{}}
         data-testid={`${testIdPrefix}-courseId`}
         data-course-id={`${courseId}`}
killedBy: CourseStaffTable tests renders empty table correctly
statusReason: expect(element).toHaveStyle()

- Expected

- display: none;
+ display: block;
